Revit 2024 API
BoxPlacement Enumeration
 An enumerated type containing possible constraint types for Adaptive Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum BoxPlacement
Visual Basic
Public Enumeration BoxPlacement
Visual C++
public enum class BoxPlacement
Members
Member name | Description
Center |  Placement of a box by its center point
TopLeft |  Placement of a box by its top left corner.
TopRight |  Placement of a box by its top right corner.
BottomRight |  Placement of a box by its bottom right corner.
BottomLeft |  Placement of a box by its bottom left corner.
See Also
Autodesk.Revit.DB Namespace